{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Neo4j Connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# import the neo4j driver for Python\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "\n",
    "# Database Credentials\n",
    "uri             = \"bolt://100.25.150.198:32899\" # Neo4j Sandbox\n",
    "userName        = \"neo4j\"\n",
    "password        = \"groove-clamps-sharpeners\"\n",
    " \n",
    "# Connect to the neo4j database server\n",
    "graphDB_conn  = GraphDatabase.driver(uri, auth=(userName, password))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### General Import"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import pickle\n",
    "import os\n",
    "import import_ipynb\n",
    "\n",
    "%run ./helper_functions/shared_functions_basic.ipynb"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import the profile of the customers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>CUSTOMER_ID</th>\n",
       "      <th>x_customer_id</th>\n",
       "      <th>y_customer_id</th>\n",
       "      <th>mean_amount</th>\n",
       "      <th>std_amount</th>\n",
       "      <th>mean_nb_tx_per_day</th>\n",
       "      <th>available_terminals</th>\n",
       "      <th>nb_terminals</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>54.881350</td>\n",
       "      <td>71.518937</td>\n",
       "      <td>62.262521</td>\n",
       "      <td>31.131260</td>\n",
       "      <td>2.179533</td>\n",
       "      <td>[29, 87, 144, 241, 330, 858, 996]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>42.365480</td>\n",
       "      <td>64.589411</td>\n",
       "      <td>46.570785</td>\n",
       "      <td>23.285393</td>\n",
       "      <td>3.567092</td>\n",
       "      <td>[5, 160, 242, 378, 431, 475, 571, 762, 876, 93...</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>96.366276</td>\n",
       "      <td>38.344152</td>\n",
       "      <td>80.213879</td>\n",
       "      <td>40.106939</td>\n",
       "      <td>2.115580</td>\n",
       "      <td>[316, 406, 447, 523, 968]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>56.804456</td>\n",
       "      <td>92.559664</td>\n",
       "      <td>11.748426</td>\n",
       "      <td>5.874213</td>\n",
       "      <td>0.348517</td>\n",
       "      <td>[65, 94, 113, 364, 401, 433, 485, 651, 672, 77...</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>2.021840</td>\n",
       "      <td>83.261985</td>\n",
       "      <td>78.924891</td>\n",
       "      <td>39.462446</td>\n",
       "      <td>3.480049</td>\n",
       "      <td>[372, 614, 774]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>495</th>\n",
       "      <td>495</td>\n",
       "      <td>94.174214</td>\n",
       "      <td>72.104341</td>\n",
       "      <td>33.307175</td>\n",
       "      <td>16.653588</td>\n",
       "      <td>2.836935</td>\n",
       "      <td>[56, 568, 682, 783, 794]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>496</th>\n",
       "      <td>496</td>\n",
       "      <td>73.193028</td>\n",
       "      <td>34.222633</td>\n",
       "      <td>40.680913</td>\n",
       "      <td>20.340457</td>\n",
       "      <td>1.436426</td>\n",
       "      <td>[17, 41, 207, 273, 441, 695, 703, 828]</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>497</th>\n",
       "      <td>497</td>\n",
       "      <td>61.661844</td>\n",
       "      <td>90.041015</td>\n",
       "      <td>21.453357</td>\n",
       "      <td>10.726679</td>\n",
       "      <td>3.500798</td>\n",
       "      <td>[99, 113, 401, 433, 539, 672, 680]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>498</th>\n",
       "      <td>498</td>\n",
       "      <td>2.765316</td>\n",
       "      <td>66.033860</td>\n",
       "      <td>44.371693</td>\n",
       "      <td>22.185846</td>\n",
       "      <td>3.165126</td>\n",
       "      <td>[7, 25, 49, 201, 504]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>499</th>\n",
       "      <td>499</td>\n",
       "      <td>72.119811</td>\n",
       "      <td>48.010781</td>\n",
       "      <td>66.167083</td>\n",
       "      <td>33.083542</td>\n",
       "      <td>2.007093</td>\n",
       "      <td>[193, 276, 306, 340, 556, 642, 689, 701, 738, ...</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>500 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     CUSTOMER_ID  x_customer_id  y_customer_id  mean_amount  std_amount  \\\n",
       "0              0      54.881350      71.518937    62.262521   31.131260   \n",
       "1              1      42.365480      64.589411    46.570785   23.285393   \n",
       "2              2      96.366276      38.344152    80.213879   40.106939   \n",
       "3              3      56.804456      92.559664    11.748426    5.874213   \n",
       "4              4       2.021840      83.261985    78.924891   39.462446   \n",
       "..           ...            ...            ...          ...         ...   \n",
       "495          495      94.174214      72.104341    33.307175   16.653588   \n",
       "496          496      73.193028      34.222633    40.680913   20.340457   \n",
       "497          497      61.661844      90.041015    21.453357   10.726679   \n",
       "498          498       2.765316      66.033860    44.371693   22.185846   \n",
       "499          499      72.119811      48.010781    66.167083   33.083542   \n",
       "\n",
       "     mean_nb_tx_per_day                                available_terminals  \\\n",
       "0              2.179533                  [29, 87, 144, 241, 330, 858, 996]   \n",
       "1              3.567092  [5, 160, 242, 378, 431, 475, 571, 762, 876, 93...   \n",
       "2              2.115580                          [316, 406, 447, 523, 968]   \n",
       "3              0.348517  [65, 94, 113, 364, 401, 433, 485, 651, 672, 77...   \n",
       "4              3.480049                                    [372, 614, 774]   \n",
       "..                  ...                                                ...   \n",
       "495            2.836935                           [56, 568, 682, 783, 794]   \n",
       "496            1.436426             [17, 41, 207, 273, 441, 695, 703, 828]   \n",
       "497            3.500798                 [99, 113, 401, 433, 539, 672, 680]   \n",
       "498            3.165126                              [7, 25, 49, 201, 504]   \n",
       "499            2.007093  [193, 276, 306, 340, 556, 642, 689, 701, 738, ...   \n",
       "\n",
       "     nb_terminals  \n",
       "0               7  \n",
       "1              12  \n",
       "2               5  \n",
       "3              14  \n",
       "4               3  \n",
       "..            ...  \n",
       "495             5  \n",
       "496             8  \n",
       "497             7  \n",
       "498             5  \n",
       "499            10  \n",
       "\n",
       "[500 rows x 8 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "DIR_INPUT='./Baseline/simulation_data/customer_profile/customer_profile.pkl'\n",
    "\n",
    "customer_df= pd.read_pickle(DIR_INPUT)\n",
    "\n",
    "customer_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "500 customers profile have been created."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creation of the nodes Customer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "with graphDB_conn.session() as graphDB:\n",
    "    for index, row in customer_df.iterrows():\n",
    "        graphDB.run('''MERGE (c:Customer {customerId:$id,latitude:$Lat,longitude:$Long,meanAmount:$MeanAmount, stdAmount:$STDAmount, meanNb_tx_per_day:$MeanTxDay})''',\\\n",
    "                    parameters = {'id': int(row['CUSTOMER_ID']), \\\n",
    "                          'Lat': float(row['x_customer_id']), \\\n",
    "                          'Long': float(row['y_customer_id']), \\\n",
    "                          'MeanAmount': float(row['mean_amount']),\\\n",
    "                          'STDAmount': float(row['std_amount']),\\\n",
    "                          'MeanTxDay': float(row['mean_nb_tx_per_day']) })\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graphDB_conn.session().run('''MATCH (c: Customer) RETURN c LIMIT 10''').data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By running this query into Neo4j, we will have 10 Nodes displayed.\n",
    "\n",
    "<img src=\"Customer_Nodes.png\" alt=\"Text\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import the terminals information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TERMINAL_ID</th>\n",
       "      <th>x_terminal_id</th>\n",
       "      <th>y_terminal_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>41.702200</td>\n",
       "      <td>72.032449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>0.011437</td>\n",
       "      <td>30.233257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>14.675589</td>\n",
       "      <td>9.233859</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>18.626021</td>\n",
       "      <td>34.556073</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>39.676747</td>\n",
       "      <td>53.881673</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>995</th>\n",
       "      <td>995</td>\n",
       "      <td>86.414409</td>\n",
       "      <td>44.789892</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>996</th>\n",
       "      <td>996</td>\n",
       "      <td>56.178626</td>\n",
       "      <td>73.671096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>997</th>\n",
       "      <td>997</td>\n",
       "      <td>79.648887</td>\n",
       "      <td>44.750814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>998</th>\n",
       "      <td>998</td>\n",
       "      <td>18.412756</td>\n",
       "      <td>82.873285</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>999</th>\n",
       "      <td>999</td>\n",
       "      <td>3.099796</td>\n",
       "      <td>94.672827</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1000 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     TERMINAL_ID  x_terminal_id  y_terminal_id\n",
       "0              0      41.702200      72.032449\n",
       "1              1       0.011437      30.233257\n",
       "2              2      14.675589       9.233859\n",
       "3              3      18.626021      34.556073\n",
       "4              4      39.676747      53.881673\n",
       "..           ...            ...            ...\n",
       "995          995      86.414409      44.789892\n",
       "996          996      56.178626      73.671096\n",
       "997          997      79.648887      44.750814\n",
       "998          998      18.412756      82.873285\n",
       "999          999       3.099796      94.672827\n",
       "\n",
       "[1000 rows x 3 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "DIR='./Baseline/simulation_data/terminal/terminal.pkl'\n",
    "\n",
    "terminal_df= pd.read_pickle(DIR)\n",
    "\n",
    "terminal_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1000 terminals have been created"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creation of the nodes Terminal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "with graphDB_conn.session() as graphDB:\n",
    "    for index, row in terminal_df.iterrows():\n",
    "        graphDB.run('''MERGE (a:Terminal {terminalId:$id,latitude:$Lat,longitude:$Long})''', \\\n",
    "                    parameters = {'id': int(row['TERMINAL_ID']), \\\n",
    "                          'Lat': float(row['x_terminal_id']), \\\n",
    "                          'Long': float(row['y_terminal_id'])})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graphDB_conn.session().run('''MATCH (t: Terminal) RETURN t LIMIT 10''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By running this query into Neo4j, we will have 10 terminal Nodes displayed.\n",
    "\n",
    "<img src=\"Terminal_Nodes.png\" alt=\"Text\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creation of the relationship \"CONNECTED\" between Customer and terminal in a radius = 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "with graphDB_conn.session() as graphDB:\n",
    "    for index, row in customer_df.iterrows():\n",
    "        graphDB.run('''MATCH (t:Terminal),(c:Customer) WHERE t.terminalId in $Idterm AND c.customerId=$idcust MERGE (c)-[:CONNECTED]->(t)''', \\\n",
    "                    parameters = {'idcust': int(row['CUSTOMER_ID']), \\\n",
    "                          'Idterm': [ int(idterm) for idterm in row['available_terminals']]})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graphDB_conn.session().run('''MATCH p=(c:Customer)-[:CONNECTED]->(:Terminal)\n",
    "WHERE c.customerId=1\n",
    "RETURN p''').data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By running this query into Neo4j, we get the relationship between a customer and the terminals around.\n",
    "\n",
    "<img src=\"Relationship Customer-Terminal.png\" alt=\"Text\"/>\n",
    "\n",
    "The customer id=1 has connection with 12 terminals in a radius=5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import the transaction of 2 days."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Load  files\n",
      "Wall time: 1.44 s\n"
     ]
    }
   ],
   "source": [
    "DIR_INPUT='./Baseline/simulation_data/transformed_features/' \n",
    "\n",
    "BEGIN_DATE = \"2018-04-01\"\n",
    "END_DATE = \"2018-04-02\"\n",
    "\n",
    "print(\"Load  files\")\n",
    "%time transactions_df=read_from_files(DIR_INPUT, BEGIN_DATE, END_DATE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TRANSACTION_ID</th>\n",
       "      <th>TX_DATETIME</th>\n",
       "      <th>CUSTOMER_ID</th>\n",
       "      <th>TERMINAL_ID</th>\n",
       "      <th>TX_AMOUNT</th>\n",
       "      <th>TX_TIME_SECONDS</th>\n",
       "      <th>TX_TIME_DAYS</th>\n",
       "      <th>TX_FRAUD</th>\n",
       "      <th>TX_FRAUD_SCENARIO</th>\n",
       "      <th>TX_DURING_WEEKEND</th>\n",
       "      <th>...</th>\n",
       "      <th>CUSTOMER_ID_NB_TX_7DAY_WINDOW</th>\n",
       "      <th>CUSTOMER_ID_AVG_AMOUNT_7DAY_WINDOW</th>\n",
       "      <th>CUSTOMER_ID_NB_TX_30DAY_WINDOW</th>\n",
       "      <th>CUSTOMER_ID_AVG_AMOUNT_30DAY_WINDOW</th>\n",
       "      <th>TERMINAL_ID_NB_TX_1DAY_WINDOW</th>\n",
       "      <th>TERMINAL_ID_RISK_1DAY_WINDOW</th>\n",
       "      <th>TERMINAL_ID_NB_TX_7DAY_WINDOW</th>\n",
       "      <th>TERMINAL_ID_RISK_7DAY_WINDOW</th>\n",
       "      <th>TERMINAL_ID_NB_TX_30DAY_WINDOW</th>\n",
       "      <th>TERMINAL_ID_RISK_30DAY_WINDOW</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>2018-04-01 00:07:56</td>\n",
       "      <td>2</td>\n",
       "      <td>316</td>\n",
       "      <td>146.00</td>\n",
       "      <td>476</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>146.000000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>146.000000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>2018-04-01 00:30:05</td>\n",
       "      <td>360</td>\n",
       "      <td>584</td>\n",
       "      <td>92.74</td>\n",
       "      <td>1805</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>92.740000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>92.740000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>2018-04-01 00:32:35</td>\n",
       "      <td>183</td>\n",
       "      <td>992</td>\n",
       "      <td>39.30</td>\n",
       "      <td>1955</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>39.300000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>39.300000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>2018-04-01 00:43:59</td>\n",
       "      <td>382</td>\n",
       "      <td>283</td>\n",
       "      <td>15.35</td>\n",
       "      <td>2639</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>15.350000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>15.350000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>2018-04-01 00:45:51</td>\n",
       "      <td>381</td>\n",
       "      <td>799</td>\n",
       "      <td>23.15</td>\n",
       "      <td>2751</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>23.150000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>23.150000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1930</th>\n",
       "      <td>1930</td>\n",
       "      <td>2018-04-02 23:14:25</td>\n",
       "      <td>206</td>\n",
       "      <td>450</td>\n",
       "      <td>22.00</td>\n",
       "      <td>170065</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>7.0</td>\n",
       "      <td>22.860000</td>\n",
       "      <td>7.0</td>\n",
       "      <td>22.860000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1931</th>\n",
       "      <td>1931</td>\n",
       "      <td>2018-04-02 23:34:52</td>\n",
       "      <td>254</td>\n",
       "      <td>502</td>\n",
       "      <td>75.52</td>\n",
       "      <td>171292</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>5.0</td>\n",
       "      <td>93.576000</td>\n",
       "      <td>5.0</td>\n",
       "      <td>93.576000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1932</th>\n",
       "      <td>1932</td>\n",
       "      <td>2018-04-02 23:40:28</td>\n",
       "      <td>197</td>\n",
       "      <td>725</td>\n",
       "      <td>71.57</td>\n",
       "      <td>171628</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>6.0</td>\n",
       "      <td>44.256667</td>\n",
       "      <td>6.0</td>\n",
       "      <td>44.256667</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1933</th>\n",
       "      <td>1933</td>\n",
       "      <td>2018-04-02 23:42:21</td>\n",
       "      <td>376</td>\n",
       "      <td>137</td>\n",
       "      <td>86.04</td>\n",
       "      <td>171741</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>6.0</td>\n",
       "      <td>113.233333</td>\n",
       "      <td>6.0</td>\n",
       "      <td>113.233333</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1934</th>\n",
       "      <td>1934</td>\n",
       "      <td>2018-04-02 23:51:22</td>\n",
       "      <td>259</td>\n",
       "      <td>736</td>\n",
       "      <td>16.22</td>\n",
       "      <td>172282</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>6.0</td>\n",
       "      <td>17.768333</td>\n",
       "      <td>6.0</td>\n",
       "      <td>17.768333</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1935 rows × 23 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      TRANSACTION_ID         TX_DATETIME  CUSTOMER_ID  TERMINAL_ID  TX_AMOUNT  \\\n",
       "0                  0 2018-04-01 00:07:56            2          316     146.00   \n",
       "1                  1 2018-04-01 00:30:05          360          584      92.74   \n",
       "2                  2 2018-04-01 00:32:35          183          992      39.30   \n",
       "3                  3 2018-04-01 00:43:59          382          283      15.35   \n",
       "4                  4 2018-04-01 00:45:51          381          799      23.15   \n",
       "...              ...                 ...          ...          ...        ...   \n",
       "1930            1930 2018-04-02 23:14:25          206          450      22.00   \n",
       "1931            1931 2018-04-02 23:34:52          254          502      75.52   \n",
       "1932            1932 2018-04-02 23:40:28          197          725      71.57   \n",
       "1933            1933 2018-04-02 23:42:21          376          137      86.04   \n",
       "1934            1934 2018-04-02 23:51:22          259          736      16.22   \n",
       "\n",
       "      TX_TIME_SECONDS  TX_TIME_DAYS  TX_FRAUD  TX_FRAUD_SCENARIO  \\\n",
       "0                 476             0         0                  0   \n",
       "1                1805             0         0                  0   \n",
       "2                1955             0         0                  0   \n",
       "3                2639             0         0                  0   \n",
       "4                2751             0         0                  0   \n",
       "...               ...           ...       ...                ...   \n",
       "1930           170065             1         0                  0   \n",
       "1931           171292             1         0                  0   \n",
       "1932           171628             1         0                  0   \n",
       "1933           171741             1         0                  0   \n",
       "1934           172282             1         0                  0   \n",
       "\n",
       "      TX_DURING_WEEKEND  ...  CUSTOMER_ID_NB_TX_7DAY_WINDOW  \\\n",
       "0                     1  ...                            1.0   \n",
       "1                     1  ...                            1.0   \n",
       "2                     1  ...                            1.0   \n",
       "3                     1  ...                            1.0   \n",
       "4                     1  ...                            1.0   \n",
       "...                 ...  ...                            ...   \n",
       "1930                  0  ...                            7.0   \n",
       "1931                  0  ...                            5.0   \n",
       "1932                  0  ...                            6.0   \n",
       "1933                  0  ...                            6.0   \n",
       "1934                  0  ...                            6.0   \n",
       "\n",
       "      CUSTOMER_ID_AVG_AMOUNT_7DAY_WINDOW  CUSTOMER_ID_NB_TX_30DAY_WINDOW  \\\n",
       "0                             146.000000                             1.0   \n",
       "1                              92.740000                             1.0   \n",
       "2                              39.300000                             1.0   \n",
       "3                              15.350000                             1.0   \n",
       "4                              23.150000                             1.0   \n",
       "...                                  ...                             ...   \n",
       "1930                           22.860000                             7.0   \n",
       "1931                           93.576000                             5.0   \n",
       "1932                           44.256667                             6.0   \n",
       "1933                          113.233333                             6.0   \n",
       "1934                           17.768333                             6.0   \n",
       "\n",
       "      CUSTOMER_ID_AVG_AMOUNT_30DAY_WINDOW  TERMINAL_ID_NB_TX_1DAY_WINDOW  \\\n",
       "0                              146.000000                            0.0   \n",
       "1                               92.740000                            0.0   \n",
       "2                               39.300000                            0.0   \n",
       "3                               15.350000                            0.0   \n",
       "4                               23.150000                            0.0   \n",
       "...                                   ...                            ...   \n",
       "1930                            22.860000                            0.0   \n",
       "1931                            93.576000                            0.0   \n",
       "1932                            44.256667                            0.0   \n",
       "1933                           113.233333                            0.0   \n",
       "1934                            17.768333                            0.0   \n",
       "\n",
       "      TERMINAL_ID_RISK_1DAY_WINDOW  TERMINAL_ID_NB_TX_7DAY_WINDOW  \\\n",
       "0                              0.0                            0.0   \n",
       "1                              0.0                            0.0   \n",
       "2                              0.0                            0.0   \n",
       "3                              0.0                            0.0   \n",
       "4                              0.0                            0.0   \n",
       "...                            ...                            ...   \n",
       "1930                           0.0                            0.0   \n",
       "1931                           0.0                            0.0   \n",
       "1932                           0.0                            0.0   \n",
       "1933                           0.0                            0.0   \n",
       "1934                           0.0                            0.0   \n",
       "\n",
       "      TERMINAL_ID_RISK_7DAY_WINDOW  TERMINAL_ID_NB_TX_30DAY_WINDOW  \\\n",
       "0                              0.0                             0.0   \n",
       "1                              0.0                             0.0   \n",
       "2                              0.0                             0.0   \n",
       "3                              0.0                             0.0   \n",
       "4                              0.0                             0.0   \n",
       "...                            ...                             ...   \n",
       "1930                           0.0                             0.0   \n",
       "1931                           0.0                             0.0   \n",
       "1932                           0.0                             0.0   \n",
       "1933                           0.0                             0.0   \n",
       "1934                           0.0                             0.0   \n",
       "\n",
       "      TERMINAL_ID_RISK_30DAY_WINDOW  \n",
       "0                               0.0  \n",
       "1                               0.0  \n",
       "2                               0.0  \n",
       "3                               0.0  \n",
       "4                               0.0  \n",
       "...                             ...  \n",
       "1930                            0.0  \n",
       "1931                            0.0  \n",
       "1932                            0.0  \n",
       "1933                            0.0  \n",
       "1934                            0.0  \n",
       "\n",
       "[1935 rows x 23 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "transactions_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creation of the relationship \"BROUGHT_IN\" between the customer and the terminals"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "with graphDB_conn.session() as graphDB:\n",
    "    for index, row in transactions_df.iterrows():\n",
    "        graphDB.run('''MATCH (t:Terminal),(c:Customer) WHERE t.terminalId=$Idterm AND c.customerId=$idcust \n",
    "        MERGE (c)-[:BROUGHT_IN{tx_Amount:$txAmount,tx_During_Weekend:$txDuringWeekend, tx_During_Night:$txDuringNight, customer_Id_Nb_Tx_1Day_Window:$customerIdNbTx1DayWindow,\n",
    "       customer_Id_Avg_Amount_1day_Window:$customerIdAvgAmount1dayWindow, customer_Id_Nb_Tx_7Day_Window:$customerIdNbTx7DayWindow,\n",
    "       customer_Id_Avg_Amount_7Day_Window:$customerIdAvgAmount7DayWindow, customer_Id_Nb_Tx_30Day_Window:$customerIdNbTx30DayWindow,\n",
    "       customer_Id_Avg_Amount_30Day_Window:$customerIdAvgAmount30DayWindow, terminal_Id_Nb_Tx_1Day_Window:$terminalIdNbTx1DayWindow,\n",
    "       terminal_Id_Risk_1Day_Window:$terminalIdRisk1DayWindow , terminal_Id_Nb_Tx_7Day_Window:$terminalIdNbTx7DayWindow,\n",
    "       terminal_Id_Risk_7Day_Window:$terminalIdRisk7DayWindow, terminal_Id_Nb_Tx_30Day_Window:$terminalIdNbTx30DayWindow,\n",
    "       terminal_Id_Risk_30Day_Window:$terminalIdRisk30DayWindow,tx_Fraud:$txFraud}]->(t)''', \\\n",
    "                    parameters = {'idcust': int(row['CUSTOMER_ID']),\\\n",
    "                                  'Idterm': int(row['TERMINAL_ID']),\\\n",
    "                                  'txAmount':float(row['TX_AMOUNT']),\\\n",
    "                                  'txDuringWeekend':float(row['TX_DURING_WEEKEND']),\\\n",
    "                                  'txDuringNight': float(row['TX_DURING_NIGHT']),\\\n",
    "                                  'customerIdNbTx1DayWindow': int(row['CUSTOMER_ID_NB_TX_1DAY_WINDOW']),\\\n",
    "                                  'customerIdAvgAmount1dayWindow':float(row['CUSTOMER_ID_AVG_AMOUNT_1DAY_WINDOW']),\\\n",
    "                                  'customerIdNbTx7DayWindow':int(row['CUSTOMER_ID_NB_TX_7DAY_WINDOW']),\\\n",
    "                                  'customerIdAvgAmount7DayWindow': float(row['CUSTOMER_ID_AVG_AMOUNT_7DAY_WINDOW']),\\\n",
    "                                  'customerIdNbTx30DayWindow': int(row['CUSTOMER_ID_NB_TX_30DAY_WINDOW']),\\\n",
    "                                  'customerIdAvgAmount30DayWindow':float(row['CUSTOMER_ID_AVG_AMOUNT_30DAY_WINDOW']),\\\n",
    "                                  'terminalIdNbTx1DayWindow':int(row['TERMINAL_ID_NB_TX_1DAY_WINDOW']),\\\n",
    "                                  'terminalIdRisk1DayWindow': float(row['TERMINAL_ID_RISK_1DAY_WINDOW']),\\\n",
    "                                  'terminalIdNbTx7DayWindow': int(row['TERMINAL_ID_NB_TX_7DAY_WINDOW']),\\\n",
    "                                  'terminalIdRisk7DayWindow':float(row['TERMINAL_ID_RISK_7DAY_WINDOW']),\\\n",
    "                                  'terminalIdNbTx30DayWindow':int(row['TERMINAL_ID_NB_TX_30DAY_WINDOW']),\\\n",
    "                                  'terminalIdRisk30DayWindow': float(row['TERMINAL_ID_RISK_30DAY_WINDOW']),\\\n",
    "                                  'txFraud': int(row['TX_FRAUD'])\n",
    "                                 })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graphDB_conn.session().run('''MATCH p=(c:Customer)-[:BROUGHT_IN]->(:Terminal)\n",
    "RETURN p\n",
    "LIMIT 25''').data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By running this query into Neo4j, we get the transactions of the customer to a terminal.\n",
    "\n",
    "<img src=\"Transaction.png\" alt=\"Text\"/>\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
